{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"trainable": true, "dtype": "float32", "name": "dense_1", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 600, "kernel_constraint": null, "activity_regularizer": null, "batch_input_shape": [null, 784], "bias_regularizer": null, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_2", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 600, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_2", "trainable": true, "activation": "relu"}}, {"class_name": "Dense", "config": {"trainable": true, "name": "dense_3", "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "distribution": "uniform", "seed": null, "scale": 1.0}}, "use_bias": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 10, "kernel_constraint": null, "activity_regularizer": null, "bias_regularizer": null, "activation": "linear", "bias_constraint": null}}, {"class_name": "Activation", "config": {"name": "activation_3", "trainable": true, "activation": "softmax"}}], "backend": "theano", "keras_version": "2.0.1"}